/*
1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.
2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр
3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори
4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт
5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
Значення площі зберігати в змінній s.
6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
результат помістіть у змінну v.
7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).

*/
let numbers = [1 ,2 ,33 ,45 ,67 ,87 ,443 ,567 ,21 ,58 ];
console.log(numbers[0] + numbers[1] + numbers[2] + numbers[3] +numbers[4] + numbers[5] + numbers[6] + numbers[7] + numbers[8] + numbers[9]);
let book1 = {
    name: 'Високі Гори Португалії',
    pages: 337,
    genre: 'novel',
}
let book2 = {
    name: 'У Дикій Глушині',
    pages: 275,
    genre: 'adventure',
    author: 'Джон Кракауер',
}
let books =[book1 , book2];
  console.log(books);
  console.log(books[0]);
  console.log(books[1]);

let height = 23;
let width = 10;
let s = height * width;
console.log(s);

let heightC = 10;
let dC = 4;
const PI = 3.14;
let v = PI * Math.pow(dC/2,2)*heightC;
console.log(v);

let n = 3;
let m = 4;
let k = Math.sqrt(n**3 + m**4);
console.log(k);


